# lst = ["Москва", "Уфа", "Тверь", "Казань"]
#
# #-------------------------------------------
# #                                                                # Срезы
# # список[start:stop:step]
#
# lst_1 = lst[1:3]
#
# lst_2 = lst[:]                                                   # создание копии списка
# print(lst_1)
#
# lst_1[0] = "Воронеж"
#
# print(lst)
# print(lst_1)
# print(lst_2)
# print(id(lst))
# print(id(lst_2))

#------------------------------------
# numbers = [2, 3, 4, 5, 3, 2]
#
# numbers[2:4] = ["хорошо", "отлично"]
#
# print(numbers)

#---------------------------------------
print([1, 2, 3] > [1, 2, 3])

print([1, 2, 3] == [1, 2, 3])

print([1, 2, 'abc'] > [1, 2, 'abd'])