#-----------------------         -----         десятичная система счисления          -----
#                                        <число>е<целая степень десятки>
# a = 1e-2                              # --> a = 1 * 10 ** -2 = 1 * 0.01 = 0.01
# a1 = 5e2                              # --> a1 = 5 * 10 ** 2 = 5 * 100 = 500
#
# print(a)
# print(a1)

# #----------------------------           -----   двоичная система счисления        -----
# a2 = 0b001
# a3 = 0b1101
# a4 = -0b0011
#
# print(a2)
# print(a3)
# print(a4)

# b = bin(13)
#
# print(b)

# #----------------------              -----  шестнадцатиричная система счисления    -----
# a = 0x1A
# b = 0xde
#
# print(a)
# print(b)

#-------------------             -----   восьмиричная система счисления  -----
a = 0o54
a1 = -0o77

print(a)
print(a1)