# a = [1, 2, 3, 4]
# b = [4, 5, 6, 7, 8, 9, 10]
#
# z = zip(a, b)
#
# # print(next(z))
# # print(next(z))
# # print(next(z))
# # print(next(z))
#
# #--------------
# for x in z:
#     print(x)

# #--------------
# a = [1, 2, 3, 4]
# b = [4, 5, 6, 7, 8, 9, 10]
# c = "python"
#
# z = zip(a, b, c)
# for x in z:
#     print(x)

# #-------------------
# a = [1, 2, 3, 4]                            # вывод распакованного кортежа
# b = [4, 5, 6, 7, 8, 9, 10]
# c = "python"
#
# z = zip(a, b, c)
# for v1, v2, v3 in z:
#     print(v1, v2, v3)

# #-------------------
# a = [1, 2, 3, 4]                            # еще 1 способов вывода
# b = [4, 5, 6, 7, 8, 9, 10]
# c = "python"
#
# z1, z2, z3, z4 = zip(a, b, c)
# print(z1, z2, z3, z4)

# #-------------------
# a = [1, 2, 3, 4]                            #  и еще 1 способов вывода
# b = [4, 5, 6, 7, 8, 9, 10]
# c = "python"
#
# z1, *z2 = zip(a, b, c)
# print(z1, z2)

# #-------------------
# a = [1, 2, 3, 4]                            #  и еще 1 способов вывода
# b = [4, 5, 6, 7, 8, 9, 10]
# c = "python"
#
# z = zip(a, b, c)
# lz = list(z)
# t1, t2, t3 = zip(*lz)
# print(t1, t2, t3, sep="\n")

#-------------------
a = [1, 2, 3, 4]                            #  более удобная запись (но нужно у всех просмотреть результат)
b = [4, 5, 6, 7, 8, 9, 10]
c = "python"

z = zip(a, b, c)
t1, t2, t3 = zip(*z)
print(t1, t2, t3, sep="\n")