# print(2, 5, 7)
#
##----------------------------------------------
a = -6.84
# print(a)
#
##-----------------------------------------------
# print(abs(a * 2 + 3))
#
##-----------------------------------------------
# # print('hello')
#
# #-------------------------------------------------
# b = 7
# c = 25.8
#
# print(a, b, c, sep=", ")
#
# #--------------------------------------------------
# print("Hello", end=" ")
# print("World!")
#
# #--------------------------------------------------
# x = 5.76
# y = 9.25
#
# print(f"Координаты точки: x = {x}; y = {y}")

##----------------------------------------------------
# # a1 = input()
# # print(a1, type(a1))
#
# a1 = int(input())
# b = abs(a1)
# print(b)

# #-----------------------------------------------------
# c = float(input())
# d = abs(c)
#
# print(d)

# #-------------------------------------------------------
# # Найдем периметр прямоугольника
# a = float(input("Введите длину прямоугольника: "))
# b = float(input("Введите ширину прямоугольника: "))
#
# print("Периметр: ", 2 * (a + b))

#--------------------------------------------------------
a, b = map(float, input("Введите две стороны прямоугольника: ").split())
print("Периметр: ", 2 * (a + b))