# n = 6
# a = [0] * n
#
# # for i in range(n):
# #     a[i] = i ** 2
#
# a = [x ** 2 for x in range(n)]
#
# print(a)

# #----------------------------------
# a = [1 for x in range(5)]
# print(a)

# #----------------------------------
n = 7
# a = [1 for x in range(7)]
# print(a)

# #-----------------------------------
# a = [x % 4 for x in range(n)]
# print(a)

# #--------------------------------------
# a = [x % 2 == 0 for x in range(n)]
# print(a)

# #---------------------------------------
# a = [0.5 * x + 1 for x in range(n)]
# print(a)

# #---------------------------------------
# d_inp = input("Введите целые числа через пробел: ")
#
# a = [int(d) for d in d_inp.split()]
# print(a)

# #----------------------------------------
# a = [d for d in 'python']
# print(a)

# #-----------------------------------------
# words = ["Python", "дай", "мне", "силы", "пройти", "этот", "курс", "до", "конца"]
# a = [d for d in words]
# print(a)

# #-------------------------------------------
# a = [len(d) for d in words]
# print(a)

# #---------------------------------------------
# a = [x for x in range(-5, 5) if x < 0]
# print(a)

# #----------------------------------------------
# a = [x for x in range(-5, 5) if x % 2 == 0]
# print(a)

# #------------------------------------------------
# a = [x for x in range(-18, 19) if x % 2 == 0 and x % 3 == 0]
# print(a)

# #-----------------------------------------------
# cities = ['Москва', 'Тверь', 'Рязань', 'Ярославль', 'Владимир']
# a = [city for city in cities if len(city) < 7]
# print(a)

#--------------------------------------------------
d = [4, 3, -5, 0, 2, 11, 112, -8, 9]
a = ['четное' if x % 2 == 0 else 'нечетное' for x in d]
print(a)